ARMmbed/mbed-os/targets/TARGET_Atmel/TARGET_SAM_CortexM0P/utils/cmsis/TARGET_SAMD21/include/component/comp_tcc.h
#define TCC_PATTB_OFFSET            0x64         /**< \brief (TCC_PATTB offset) Pattern Buffer */
#define TCC_PATTB_RESETVALUE        0x0000ul     /**< \brief (TCC_PATTB reset_value) Pattern Buffer */

#define TCC_PATTB_PGEB0_Pos         0            /**< \brief (TCC_PATTB) Pattern Generator 0 Output Enable Buffer */
#define TCC_PATTB_PGEB0             (1 << TCC_PATTB_PGEB0_Pos)
#define TCC_PATTB_PGEB1_Pos         1            /**< \brief (TCC_PATTB) Pattern Generator 1 Output Enable Buffer */
#define TCC_PATTB_PGEB1             (1 << TCC_PATTB_PGEB1_Pos)
#define TCC_PATTB_PGEB2_Pos         2            /**< \brief (TCC_PATTB) Pattern Generator 2 Output Enable Buffer */
#define TCC_PATTB_PGEB2             (1 << TCC_PATTB_PGEB2_Pos)
#define TCC_PATTB_PGEB3_Pos         3            /**< \brief (TCC_PATTB) Pattern Generator 3 Output Enable Buffer */
#define TCC_PATTB_PGEB3             (1 << TCC_PATTB_PGEB3_Pos)
#define TCC_PATTB_PGEB4_Pos         4            /**< \brief (TCC_PATTB) Pattern Generator 4 Output Enable Buffer */
#define TCC_PATTB_PGEB4             (1 << TCC_PATTB_PGEB4_Pos)
#define TCC_PATTB_PGEB5_Pos         5            /**< \brief (TCC_PATTB) Pattern Generator 5 Output Enable Buffer */
#define TCC_PATTB_PGEB5             (1 << TCC_PATTB_PGEB5_Pos)
#define TCC_PATTB_PGEB6_Pos         6            /**< \brief (TCC_PATTB) Pattern Generator 6 Output Enable Buffer */
#define TCC_PATTB_PGEB6             (1 << TCC_PATTB_PGEB6_Pos)
#define TCC_PATTB_PGEB7_Pos         7            /**< \brief (TCC_PATTB) Pattern Generator 7 Output Enable Buffer */
#define TCC_PATTB_PGEB7             (1 << TCC_PATTB_PGEB7_Pos)
#define TCC_PATTB_PGEB_Pos          0            /**< \brief (TCC_PATTB) Pattern Generator x Output Enable Buffer */
#define TCC_PATTB_PGEB_Msk          (0xFFul << TCC_PATTB_PGEB_Pos)
#define TCC_PATTB_PGEB(value)       ((TCC_PATTB_PGEB_Msk & ((value) << TCC_PATTB_PGEB_Pos)))
#define TCC_PATTB_PGVB0_Pos         8            /**< \brief (TCC_PATTB) Pattern Generator 0 Output Enable */
#define TCC_PATTB_PGVB0             (1 << TCC_PATTB_PGVB0_Pos)
#define TCC_PATTB_PGVB1_Pos         9            /**< \brief (TCC_PATTB) Pattern Generator 1 Output Enable */
#define TCC_PATTB_PGVB1             (1 << TCC_PATTB_PGVB1_Pos)
#define TCC_PATTB_PGVB2_Pos         10           /**< \brief (TCC_PATTB) Pattern Generator 2 Output Enable */
#define TCC_PATTB_PGVB2             (1 << TCC_PATTB_PGVB2_Pos)
#define TCC_PATTB_PGVB3_Pos         11           /**< \brief (TCC_PATTB) Pattern Generator 3 Output Enable */
#define TCC_PATTB_PGVB3             (1 << TCC_PATTB_PGVB3_Pos)
#define TCC_PATTB_PGVB4_Pos         12           /**< \brief (TCC_PATTB) Pattern Generator 4 Output Enable */
#define TCC_PATTB_PGVB4             (1 << TCC_PATTB_PGVB4_Pos)
#define TCC_PATTB_PGVB5_Pos         13           /**< \brief (TCC_PATTB) Pattern Generator 5 Output Enable */
#define TCC_PATTB_PGVB5             (1 << TCC_PATTB_PGVB5_Pos)
#define TCC_PATTB_PGVB6_Pos         14           /**< \brief (TCC_PATTB) Pattern Generator 6 Output Enable */
#define TCC_PATTB_PGVB6             (1 << TCC_PATTB_PGVB6_Pos)
#define TCC_PATTB_PGVB7_Pos         15           /**< \brief (TCC_PATTB) Pattern Generator 7 Output Enable */
#define TCC_PATTB_PGVB7             (1 << TCC_PATTB_PGVB7_Pos)
#define TCC_PATTB_PGVB_Pos          8            /**< \brief (TCC_PATTB) Pattern Generator x Output Enable */
#define TCC_PATTB_PGVB_Msk          (0xFFul << TCC_PATTB_PGVB_Pos)
#define TCC_PATTB_PGVB(value)       ((TCC_PATTB_PGVB_Msk & ((value) << TCC_PATTB_PGVB_Pos)))
#define TCC_PATTB_MASK              0xFFFFul     /**< \brief (TCC_PATTB) MASK Register */

/* -------- TCC_WAVEB : (TCC Offset: 0x68) (R/W 32) Waveform Control Buffer -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
    struct {
        uint32_t WAVEGENB: 3;      /*!< bit:  0.. 2  Waveform Generation Buffer         */
        uint32_t : 1;              /*!< bit:      3  Reserved                           */
        uint32_t RAMPB: 2;         /*!< bit:  4.. 5  Ramp Mode Buffer                   */
        uint32_t : 1;              /*!< bit:      6  Reserved                           */
        uint32_t CIPERENB: 1;      /*!< bit:      7  Circular Period Enable Buffer      */
        uint32_t CICCENB0: 1;      /*!< bit:      8  Circular Channel 0 Enable Buffer   */
        uint32_t CICCENB1: 1;      /*!< bit:      9  Circular Channel 1 Enable Buffer   */
        uint32_t CICCENB2: 1;      /*!< bit:     10  Circular Channel 2 Enable Buffer   */
        uint32_t CICCENB3: 1;      /*!< bit:     11  Circular Channel 3 Enable Buffer   */
        uint32_t : 4;              /*!< bit: 12..15  Reserved                           */
        uint32_t POLB0: 1;         /*!< bit:     16  Channel 0 Polarity Buffer          */
        uint32_t POLB1: 1;         /*!< bit:     17  Channel 1 Polarity Buffer          */
        uint32_t POLB2: 1;         /*!< bit:     18  Channel 2 Polarity Buffer          */
        uint32_t POLB3: 1;         /*!< bit:     19  Channel 3 Polarity Buffer          */
        uint32_t : 4;              /*!< bit: 20..23  Reserved                           */
        uint32_t SWAPB0: 1;        /*!< bit:     24  Swap DTI Output Pair 0 Buffer      */
        uint32_t SWAPB1: 1;        /*!< bit:     25  Swap DTI Output Pair 1 Buffer      */
        uint32_t SWAPB2: 1;        /*!< bit:     26  Swap DTI Output Pair 2 Buffer      */
        uint32_t SWAPB3: 1;        /*!< bit:     27  Swap DTI Output Pair 3 Buffer      */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } bit;                       /*!< Structure used for bit  access                  */
    struct {
        uint32_t : 8;              /*!< bit:  0.. 7  Reserved                           */
        uint32_t CICCENB: 4;       /*!< bit:  8..11  Circular Channel x Enable Buffer   */
        uint32_t : 4;              /*!< bit: 12..15  Reserved                           */
        uint32_t POLB: 4;          /*!< bit: 16..19  Channel x Polarity Buffer          */
        uint32_t : 4;              /*!< bit: 20..23  Reserved                           */
        uint32_t SWAPB: 4;         /*!< bit: 24..27  Swap DTI Output Pair x Buffer      */
        uint32_t : 4;              /*!< bit: 28..31  Reserved                           */
    } vec;                       /*!< Structure used for vec  access                  */
    uint32_t reg;                /*!< Type      used for register access              */
} TCC_WAVEB_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

